rfloyd01/PersonalCaddie/Firmware/nRF52840_Drivers/main.c
/**@brief Function for handling Peer Manager events                   
 * @param[in] p_evt  Peer Manager event.
 */
static void pm_evt_handler(pm_evt_t const * p_evt)
{
    pm_handler_on_pm_evt(p_evt);
    pm_handler_flash_clean(p_evt);

    switch (p_evt->evt_id)
    {
        case PM_EVT_PEERS_DELETE_SUCCEEDED:
            advertising_start(false);
            break;

        default:
            break;
    }
}

/**@brief Function for the LSM9DS1 initialization.
 *
 * @details Initializes the LSM9DS1 accelerometer, gyroscope and magnetometer
 */
static void sensors_init(void)
{
    //first reset the sensor settings array
    for (int i = 0; i < SENSOR_SETTINGS_LENGTH; i++) sensor_settings[i] = 0;

    //Handle the initialization of individual sensors
    lsm9ds1_init(&lsm9ds1_imu, &lsm9ds1_mag, sensor_settings, &m_twi, &m_xfer_done, USE_EXTERNAL_SENSORS);

    //after sensor initialization is complete we attempt to communicate 
    //with each sensor just to ensure that it's there and working properly.
    //To do so, turn on the TWI bus and configure/turn on any power pin(s) and/or pullup resistors
    nrf_drv_twi_enable(&m_twi);

    //configure the power pin and pullup resistor pins for the the sensors
    if (USE_EXTERNAL_SENSORS)
    {
        nrf_gpio_cfg(EXTERNAL_SENSOR_POWER_PIN, NRF_GPIO_PIN_DIR_OUTPUT, NRF_GPIO_PIN_INPUT_CONNECT, NRF_GPIO_PIN_NOPULL, NRF_GPIO_PIN_S0H1, NRF_GPIO_PIN_NOSENSE);

        nrf_gpio_pin_set(EXTERNAL_SENSOR_POWER_PIN);
        nrf_delay_ms(50); //slight delay so sensors have time to power on
    }
    else
    {
        nrf_gpio_cfg_output(BLE_33_PULLUP); //send power to BLE 33 Sense pullup resistors (they aren't connected to VDD)
        nrf_gpio_cfg(BLE_33_SENSOR_POWER_PIN, NRF_GPIO_PIN_DIR_OUTPUT, NRF_GPIO_PIN_INPUT_CONNECT, NRF_GPIO_PIN_NOPULL, NRF_GPIO_PIN_S0H1, NRF_GPIO_PIN_NOSENSE);

        nrf_gpio_pin_set(BLE_33_PULLUP);
        nrf_gpio_pin_set(BLE_33_SENSOR_POWER_PIN);
        nrf_delay_ms(50); //slight delay so sensors have time to power on
    }

    //uint8_t sample_data;
    //for (uint8_t add = 0; add <= 127; add++)
    //{
    //    ret_code_t err_code;
    //    m_xfer_done = false;
    //    do
    //    {
    //        err_code = nrf_drv_twi_rx(&m_twi, add, &sample_data, sizeof(sample_data));
    //    } while (err_code == 0x11); //if the nrf is currently busy doing something else this line will wait until its done before executing
    //    //while (m_xfer_done == false); //this line forces the program to wait for the TWI transfer to complete before moving on
    //    nrf_delay_ms(50); //slight delay so sensors have time to power on
    //}

    //attempt to read the WHOAMI register for each sensor
    uint32_t ret = lsm9ds1_dev_id_get(&lsm9ds1_mag, &lsm9ds1_imu, &whoamI);
    if (whoamI.imu == LSM9DS1_IMU_ID) SEGGER_RTT_WriteString(0, "LSM9DS1 discovered.\n");
    else SEGGER_RTT_WriteString(0, "Error: Couldn't find LSM9DS1.\n");

    //In the future, more sensors can be initialized here

    //regardless of whether or not any sensors are found, disable the power pins and TWI bus
    if (USE_EXTERNAL_SENSORS)
    {
        nrf_gpio_pin_clear(EXTERNAL_SENSOR_POWER_PIN);
    }
    else
    {
        nrf_gpio_pin_clear(BLE_33_PULLUP);
        nrf_gpio_pin_clear(BLE_33_SENSOR_POWER_PIN);
    }
    
    nrf_drv_twi_disable(&m_twi);

    //After all sensors have been initialized, update the sensor settings characteristic to 
    //reflect the sensor settings array. Furthermore, we also set the connection interval 
    //to be equal to the highest sensor ODR (to the nearest 15th millisecond)
    ble_gatts_value_t settings;
    settings.len = SENSOR_SETTINGS_LENGTH;
    settings.p_value = sensor_settings;
    settings.offset = 0;
    uint32_t err_code = sd_ble_gatts_value_set(m_conn_handle, m_ss.settings_handles.value_handle, &settings);
    APP_ERROR_CHECK(err_code);
}

static void characteristic_update_and_notify()
{
    
    ble_gatts_hvx_params_t acc_notify_params, gyr_notify_params, mag_notify_params;
    memset(&acc_notify_params, 0, sizeof(acc_notify_params));
    memset(&gyr_notify_params, 0, sizeof(gyr_notify_params));
    memset(&mag_notify_params, 0, sizeof(mag_notify_params));

    uint16_t data_characteristic_size = SENSOR_SAMPLES * SAMPLE_SIZE; //not really sure why the size needs to be passed in as a reference

    //Setup accelerometer notification first
    acc_notify_params.type = BLE_GATT_HVX_NOTIFICATION;
    acc_notify_params.handle = m_ss.data_handles[0].value_handle;
    acc_notify_params.p_data = acc_characteristic_data;
    acc_notify_params.p_len  = &data_characteristic_size;
    acc_notify_params.offset = 0;

    //Setup gyroscope notification second
    gyr_notify_params.type = BLE_GATT_HVX_NOTIFICATION;
    gyr_notify_params.handle = m_ss.data_handles[1].value_handle;
    gyr_notify_params.p_data = gyr_characteristic_data;
    gyr_notify_params.p_len  = &data_characteristic_size;
    gyr_notify_params.offset = 0;

    //Setup magnetometer notification third
    mag_notify_params.type = BLE_GATT_HVX_NOTIFICATION;
    mag_notify_params.handle = m_ss.data_handles[2].value_handle;
    mag_notify_params.p_data = mag_characteristic_data;
    mag_notify_params.p_len  = &data_characteristic_size;
    mag_notify_params.offset = 0;

    sd_ble_gatts_hvx(m_conn_handle, &acc_notify_params);
    sd_ble_gatts_hvx(m_conn_handle, &gyr_notify_params);
    sd_ble_gatts_hvx(m_conn_handle, &mag_notify_params);
}

static void data_reading_timer_handler(void * p_context)
{
    //uint32_t time_stamp = nrf_drv_timer_capture(&my_timer, NRF_TIMER_CC_CHANNEL1);
    //float clock_conversion = 1.0 / 16000000.0;
    //float actual_time = time_stamp * clock_conversion;
    //SEGGER_RTT_printf(0, "TWI initiated at %u ticks of 16MHz.\n", time_stamp);

    //Everytime the data reading timer goes off we take sensor readings and then 
    //update the appropriate characteristic values. The timer should go off once
    //every connection interval
    get_IMU_data(SAMPLE_SIZE * measurements_taken);
    get_MAG_data(SAMPLE_SIZE * measurements_taken);
    measurements_taken++;

    //TEST: bytes aren't being updated correctly
    //SEGGER_RTT_WriteString(0, "Bytes going into gyro characteristic should be:\n");
    //for (int i = 0; i < SENSOR_SAMPLES * SAMPLE_SIZE; i++) SEGGER_RTT_printf(0, "0x%#01x ", *(gyr_characteristic_data + i));
    //SEGGER_RTT_WriteString(0, "\n\n");

    //after the samples are read, update the characteristics and notify
    if ( measurements_taken == SENSOR_SAMPLES)
    {
        //SEGGER_RTT_WriteString(0, "Sending the following bytes to Acc characteristic:\n");
        //for (int i = 0; i < SENSOR_SAMPLES; i++)
        //{
        //    for (int j = 0; j < SAMPLE_SIZE; j++)
        //    {
        //        SEGGER_RTT_printf(0, "0x%#01x ", *(acc_characteristic_data + i * SENSOR_SAMPLES + j));
        //    }
        //    SEGGER_RTT_WriteString(0, "\n");
        //}
        //SEGGER_RTT_WriteString(0, "\n");

        characteristic_update_and_notify();
        measurements_taken = 0; //reset the data counter
    }
}

static void led_timer_handler(void * p_context)
{
    //This timer causes the currently active LED to light up. A separate timer is used to 
    //turn the LED back off after a set time period
    if (USE_EXTERNAL_LEDS) nrf_gpio_pin_set(active_led);
    else nrf_gpio_pin_clear(active_led);

    nrf_drv_timer_clear(&LED_ON_TIMER); //reset the LED-on timer
    nrf_drv_timer_enable(&LED_ON_TIMER); //turn on the LED_on timer, the handler for this timer will turn the LED back off
    //uint32_t timer_val = nrf_drv_timer_capture(&LED_ON_TIMER, NRF_TIMER_CC_CHANNEL1);
}

void led_on_timer_handler(nrf_timer_event_t event_type, void* p_context)
{
    //This handler gets called when an LED is turned to the active state. Simply turn the 
    //LED back off when this handler is called and then turn the LED-on timer off.
    if (USE_EXTERNAL_LEDS) nrf_gpio_pin_clear(active_led);
    else nrf_gpio_pin_set(active_led);
    nrf_drv_timer_disable(&LED_ON_TIMER);
}

/**@brief Function for the Timer initialization.
 *
 * @details Initializes the timer module. This creates and starts application timers.
 */
static void timers_init(void)
{
    // Initialize timer module.
    ret_code_t err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);

